test/solver/incompressibleVoF/cases/vofRow4Limited/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Four cells across a unit cube, split into two blocks at x = 0.5 so the first
// block -- named `source`, which is how blockMesh makes a cellZone of that name
// -- holds the two cells at x < 0.5 and the other two stay outside it. The duct
// is open (inlet at x = 0, outlet at x = 1) so the pressure corrector has an
// outflow to balance.

scale   1;

vertices
(
    (0   0 0)
    (0.5 0 0)
    (1   0 0)
    (0   1 0)
    (0.5 1 0)
    (1   1 0)
    (0   0 1)
    (0.5 0 1)
    (1   0 1)
    (0   1 1)
    (0.5 1 1)
    (1   1 1)
);

blocks
(
    hex (0 1 4 3 6 7 10 9) source (2 1 1) simpleGrading (1 1 1)
    hex (1 2 5 4 7 8 11 10)        (2 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 9 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 5 11 8)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 3 4 1)
            (1 4 5 2)
            (6 7 10 9)
            (7 8 11 10)
            (3 9 10 4)
            (4 10 11 5)
            (0 1 7 6)
            (1 2 8 7)
        );
    }
);


// ************************************************************************* //
